---
title: NestedFamilyTypeReference
classe: Autodesk.Revit.DB.NestedFamilyTypeReference
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# NestedFamilyTypeReference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId { get; }` | `nestedFamilyTypeReference.CategoryId` | ElementId |
| `String FamilyName { get; }` | `nestedFamilyTypeReference.FamilyName` | String |
| `String TypeName { get; }` | `nestedFamilyTypeReference.TypeName` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```